Eight4aWish/eurorack_modules/src/esp32_clklinkrec/main.cpp
// SPDX-License-Identifier: GPL-2.0-or-later
// Copyright (c) 2026 David Baghurst
//
// esp32_clklinkrec — Ableton Link → Eurorack clock/reset/run-gate,
//                    plus Capture → HTTP POST to the seeed-recorder
//                    Mac app, on the Seeed Xiao ESP32-C5.
//
// This module links against the Ableton Link library (GPL-2.0-or-later);
// the firmware binary is therefore GPL-2.0-or-later. See LICENSE.esp32_clklink.
//
// Behaviour:
//   Boot: Link disabled. WiFi connects; mDNS discovers the recorder
//         (with optional RECORDER_HOST fallback from secrets.h);
//         /healthz confirms reachability.
//   Link button (D0): toggle Link enable on each press.
//   Capture button (D9): POST /capture to the resolved recorder. Red LED
//                        is solid for the duration of the request and
//                        sticks if the request fails.
//   Reset In jack (D10): rising edge fires one Reset Out pulse and
//                        re-syncs Link beat phase.
//
// Link → Eurorack mapping (when enabled):
//   Clock Out  — one pulse per beat (PPQN=1) while Link is playing
//   Reset Out  — fires on transport start and on each bar boundary
//   Run Out    — high while Link reports playing, low otherwise
//
// LED encoding:
//   Blue = Link status
//     off           — Link disabled
//     fast blink    — Link enabled, WiFi not connected
//     slow blink    — Link enabled, WiFi up, no peers yet
//     solid         — locked to ≥1 Link peer
//   Red  = Recorder Capture status
//     off           — idle
//     solid (1×)    — request in flight (turns off on 200 OK)
//     solid sticky  — last request failed (cleared by next 200 OK)
//     200 ms flash  — pressed but no recorder address resolved
//
// Outputs go through a 74HCT14 inverting Schmitt buffer, so "active" at
// the jack/LED corresponds to GPIO LOW from this firmware.
//
// Protocol contract for the HTTP path lives at
// docs/RECORDER_PROTOCOL.md (v2.0). Read that first if you're changing
// behaviour on the firmware↔Mac interface.

#include <Arduino.h>
#include <WiFi.h>
#include <WiFiUdp.h>
#include <HTTPClient.h>
#include <ESPmDNS.h>
#include <esp_wifi.h>
#include <Preferences.h>
#include <soc/soc_caps.h>
#include <esp_timer.h>
#include <esp_chip_info.h>
#include <esp_system.h>
#include <esp_heap_caps.h>
#include <esp_idf_version.h>
#include <esp_log.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <math.h>
#include <string.h>
#include "abl_link.h"
#include "esp32_clklinkrec/pins.h"
#include "esp32_clklinkrec/secrets.h"

// Set to 0 once WiFi bring-up is settled. At 1 the IDF wifi tags log at
// INFO, which shows the scan/auth/assoc timeline — that is how you tell
// scan cost from handshake cost when a connect is slow.
#define WIFI_DEBUG_LOG 1

static inline void assert_out(int p)  { digitalWrite(p, LOW);  }
static inline void release_out(int p) { digitalWrite(p, HIGH); }
static inline void led_on(int p)      { digitalWrite(p, LOW);  }
static inline void led_off(int p)     { digitalWrite(p, HIGH); }
static inline bool button_down(int p) { return digitalRead(p) == LOW; }
static inline bool reset_in_active(int p) { return digitalRead(p) == LOW; }

static const char* band_of(uint8_t channel) {
    if (channel >= 1 && channel <= 14)   return "2.4 GHz";
    if (channel >= 32 && channel <= 177) return "5 GHz";
    return "?";
}

// --- Link state -----------------------------------------------------------
constexpr double   LINK_INITIAL_TEMPO = 120.0;
constexpr double   LINK_QUANTUM       = 4.0;     // beats per bar
constexpr uint32_t PULSE_WIDTH_US     = 10000;   // 10 ms per clock/reset pulse
constexpr uint32_t WIFI_CONNECT_TIMEOUT_MS = 8000;

static struct abl_link        link_handle      = {nullptr};
static abl_link_session_state link_state       = {nullptr};
static bool                   link_initialised = false;
static bool                   link_enabled     = false;
static double                 last_link_beat   = -1.0;
static bool                   link_is_playing_prev = false;

// --- Output pulse scheduling ---------------------------------------------
static unsigned long clock_end_us     = 0;
static bool          clock_active     = false;
static unsigned long reset_end_us     = 0;
static bool          reset_out_active = false;

static void fire_clock_pulse(unsigned long now_us) {
    assert_out(PIN_CLK_OUT);
    clock_end_us = now_us + PULSE_WIDTH_US;
    clock_active = true;
}

static void fire_reset_pulse(unsigned long now_us) {
    assert_out(PIN_RST_OUT);
    reset_end_us     = now_us + PULSE_WIDTH_US;
    reset_out_active = true;
}

static void update_pulse_decay(unsigned long now_us) {
    if (clock_active && (long)(now_us - clock_end_us) >= 0) {
        release_out(PIN_CLK_OUT);
        clock_active = false;
    }
    if (reset_out_active && (long)(now_us - reset_end_us) >= 0) {
        release_out(PIN_RST_OUT);
        reset_out_active = false;
    }
}

// --- Link wrappers --------------------------------------------------------
static void link_init() {
    if (link_initialised) return;
    link_handle = abl_link_create(LINK_INITIAL_TEMPO);
    link_state  = abl_link_create_session_state();
    abl_link_enable_start_stop_sync(link_handle, true);
    link_initialised = true;
    Serial.println("[Link] instance created (start/stop sync on)");
}

static void link_set_enabled(bool on) {
    if (!link_initialised || link_enabled == on) return;
    abl_link_enable(link_handle, on);
    link_enabled         = on;
    last_link_beat       = -1.0;
    link_is_playing_prev = false;
    if (!on) {
        release_out(PIN_RUN_OUT);
    }
    Serial.printf("[Link] %s\n", on ? "enabled" : "disabled");
}

static size_t link_peer_count() {
    if (!link_initialised) return 0;
    return abl_link_num_peers(link_handle);
}

static void link_tick(unsigned long now_us) {
    if (!link_initialised || !link_enabled) return;

    abl_link_capture_audio_session_state(link_handle, link_state);
    int64_t link_time_us = esp_timer_get_time();
    bool    is_playing   = abl_link_is_playing(link_state);

    if (is_playing != link_is_playing_prev) {
        if (is_playing) {
            fire_reset_pulse(now_us);
            assert_out(PIN_RUN_OUT);
            last_link_beat = -1.0;
        } else {
            release_out(PIN_RUN_OUT);
        }
        link_is_playing_prev = is_playing;
    }
    if (!is_playing) return;

    double beat = abl_link_beat_at_time(link_state, link_time_us, LINK_QUANTUM);
    if (last_link_beat < 0.0) {
        last_link_beat = beat;
        return;
    }
    int last_int = (int)floor(last_link_beat);
    int beat_int = (int)floor(beat);
    if (beat_int > last_int) {
        fire_clock_pulse(now_us);
        int bar_pos = ((beat_int % (int)LINK_QUANTUM) + (int)LINK_QUANTUM) % (int)LINK_QUANTUM;
        if (bar_pos == 0) {
            fire_reset_pulse(now_us);
        }
    }
    last_link_beat = beat;
}

// --- Recorder (HTTP/mDNS capture trigger) --------------------------------
// Wire contract: docs/RECORDER_PROTOCOL.md (v2.0).

constexpr uint32_t MDNS_QUERY_TIMEOUT_MS = 2000;
constexpr uint32_t RECORDER_HTTP_TIMEOUT_MS = 1500;
constexpr uint16_t RECORDER_DEFAULT_PORT = 8765;

