Eight4aWish/eurorack_modules/src/esp32_clklinkrec/main.cpp
enum RecorderLedState : uint8_t {
    RECORDER_LED_IDLE = 0,
    RECORDER_LED_IN_FLIGHT,
    RECORDER_LED_ERROR_STICKY,
};

static char     recorder_host[64]      = "";
static uint16_t recorder_port          = RECORDER_DEFAULT_PORT;
static bool     recorder_resolved      = false;
static volatile bool         recorder_in_flight = false;
static volatile RecorderLedState recorder_led_state = RECORDER_LED_IDLE;
static unsigned long recorder_no_addr_flash_until_ms = 0;

// Parse "host:port" or "host" from a const string into the recorder
// address slots. Returns true on success.
static bool parse_recorder_host(const char* spec) {
    if (!spec || !*spec) return false;
    const char* colon = strrchr(spec, ':');
    if (colon) {
        size_t host_len = colon - spec;
        if (host_len == 0 || host_len >= sizeof(recorder_host)) return false;
        memcpy(recorder_host, spec, host_len);
        recorder_host[host_len] = '\0';
        long p = atol(colon + 1);
        if (p <= 0 || p > 65535) return false;
        recorder_port = (uint16_t)p;
    } else {
        if (strlen(spec) >= sizeof(recorder_host)) return false;
        strcpy(recorder_host, spec);
        recorder_port = RECORDER_DEFAULT_PORT;
    }
    return true;
}

// Resolve the recorder address via mDNS, falling back to RECORDER_HOST
// from secrets.h if mDNS doesn't return a service within ~2 s.
// Sets recorder_resolved on success.
static void resolve_recorder_address() {
    recorder_resolved = false;
    recorder_host[0]  = '\0';
    recorder_port     = RECORDER_DEFAULT_PORT;

    Serial.println("[Recorder] querying mDNS for _recorder._tcp...");
    // ESPmDNS's queryService blocks ~3 s by default; this is acceptable
    // at boot / on reconnect. Returns the count of services seen.
    int n = MDNS.queryService("recorder", "tcp");
    if (n > 0) {
        IPAddress ip = MDNS.address(0);
        uint16_t  p  = MDNS.port(0);
        String    h  = MDNS.hostname(0);
        // Prefer the resolved IPv4 — .local hostnames depend on system
        // mDNS responders we can't guarantee on the HTTPClient side.
        snprintf(recorder_host, sizeof(recorder_host), "%s",
                 ip.toString().c_str());
        recorder_port = p;
        recorder_resolved = true;
        Serial.printf("[Recorder] mDNS resolved: %s (%s) port %u\n",
                      recorder_host, h.c_str(), (unsigned)recorder_port);
        return;
    }
    Serial.println("[Recorder] mDNS returned no services");

#ifdef RECORDER_HOST
    if (parse_recorder_host(RECORDER_HOST)) {
        Serial.printf("[Recorder] fallback RECORDER_HOST: %s port %u\n",
                      recorder_host, (unsigned)recorder_port);
        // HTTPClient does a plain DNS lookup that can't resolve .local
        // hostnames. If the fallback is a .local name, resolve it via
        // mDNS now and replace recorder_host with the resulting IP so
        // the POST path is a pure-IP HTTP call.
        size_t hlen = strlen(recorder_host);
        bool is_local = (hlen >= 6 &&
                         strcmp(recorder_host + hlen - 6, ".local") == 0);
        if (is_local) {
            IPAddress ip = MDNS.queryHost(recorder_host, 2000);
            if (ip != IPAddress(0, 0, 0, 0)) {
                Serial.printf("[Recorder] resolved %s -> %s via mDNS\n",
                              recorder_host, ip.toString().c_str());
                snprintf(recorder_host, sizeof(recorder_host), "%s",
                         ip.toString().c_str());
            } else {
                Serial.printf("[Recorder] mDNS could not resolve %s — "
                              "Capture will be a no-op until mDNS or the "
                              "Mac comes back\n", recorder_host);
                return;  // leave recorder_resolved = false
            }
        }
        recorder_resolved = true;
        return;
    }
    Serial.printf("[Recorder] RECORDER_HOST \"%s\" failed to parse\n",
                  RECORDER_HOST);
#else
    Serial.println("[Recorder] no RECORDER_HOST defined in secrets.h, "
                   "Capture will be a no-op until mDNS works");
#endif
}

// One-shot health check after the recorder address is resolved. Logs the
// response. A 503 is informative (recorder is up but partially failing)
// but doesn't invalidate the cached address.
static void check_recorder_healthz() {
    if (!recorder_resolved) return;
    char url[128];
    snprintf(url, sizeof(url), "http://%s:%u/healthz",
             recorder_host, (unsigned)recorder_port);
    HTTPClient http;
    http.setTimeout(RECORDER_HTTP_TIMEOUT_MS);
    if (!http.begin(url)) {
        Serial.printf("[Recorder] healthz begin() failed for %s\n", url);
        return;
    }
    int code = http.GET();
    String body = http.getString();
    http.end();
    Serial.printf("[Recorder] GET /healthz -> %d  body=%s\n",
                  code, body.c_str());
}

// FreeRTOS task: do the POST /capture round-trip without blocking loop().
// All UI/LED state changes back into the main loop happen via the
// recorder_led_state / recorder_in_flight flags.
static void capture_task(void* arg) {
    char url[128];
    snprintf(url, sizeof(url), "http://%s:%u/capture",
             recorder_host, (unsigned)recorder_port);

    HTTPClient http;
    http.setTimeout(RECORDER_HTTP_TIMEOUT_MS);
    bool began = http.begin(url);
    int code = -1;
    String body;
    if (began) {
        http.addHeader("Content-Type", "application/json");
        code = http.POST((uint8_t*)nullptr, 0);
        body = http.getString();
        http.end();
    } else {
        Serial.printf("[Recorder] capture begin() failed for %s\n", url);
    }

    if (code == 200) {
        Serial.printf("[Recorder] 200 OK  %s\n", body.c_str());
        recorder_led_state = RECORDER_LED_IDLE;
    } else if (code == 503 && body.indexOf("capture_in_flight") >= 0) {
        Serial.printf("[Recorder] 503 capture_in_flight (Mac busy) — no-op\n");
        // Don't promote the in-flight state into a sticky error; the
        // user can simply press again once the Mac finishes.
        recorder_led_state = RECORDER_LED_IDLE;
    } else if (code > 0) {
        Serial.printf("[Recorder] error: HTTP %d  body=%s\n", code, body.c_str());
        recorder_led_state = RECORDER_LED_ERROR_STICKY;
    } else {
        Serial.printf("[Recorder] error: network/timeout (code=%d)\n", code);
        recorder_led_state = RECORDER_LED_ERROR_STICKY;
    }

