Eight4aWish/eurorack_modules/src/esp32_clklinkrec/main.cpp
    recorder_in_flight = false;
    vTaskDelete(NULL);
}

static void trigger_capture() {
    if (recorder_in_flight) {
        Serial.println("[Recorder] Capture press ignored (own request in flight)");
        return;
    }
    if (!recorder_resolved) {
        Serial.println("[Recorder] Capture press: no recorder address resolved");
        // 200 ms inline flash so the user sees feedback that the press
        // was received but couldn't be served. Acceptable to block the
        // loop briefly — this only happens on misconfiguration.
        led_on(PIN_RED_LED);
        recorder_no_addr_flash_until_ms = millis() + 200;
        return;
    }
    Serial.printf("[Recorder] POST /capture -> %s:%u\n",
                  recorder_host, (unsigned)recorder_port);
    recorder_in_flight = true;
    recorder_led_state = RECORDER_LED_IN_FLIGHT;
    BaseType_t ok = xTaskCreate(capture_task, "capture",
                                /*stack*/ 8192, nullptr,
                                /*prio*/ 5, nullptr);
    if (ok != pdPASS) {
        Serial.println("[Recorder] xTaskCreate failed");
        recorder_in_flight = false;
        recorder_led_state = RECORDER_LED_ERROR_STICKY;
    }
}

// --- Buttons --------------------------------------------------------------
static void poll_buttons() {
    static bool link_prev    = false;
    static bool capture_prev = false;
    bool link_now    = button_down(PIN_SW_LINK);
    bool capture_now = button_down(PIN_SW_CAPTURE);
    if (link_now && !link_prev) {
        link_set_enabled(!link_enabled);
    }
    if (capture_now && !capture_prev) {
        trigger_capture();
    }
    link_prev    = link_now;
    capture_prev = capture_now;
}

static void poll_reset_in(unsigned long now_us) {
    static bool prev = false;
    bool now_active = reset_in_active(PIN_RESET_IN);
    if (now_active && !prev) {
        Serial.println("[Reset In] external trigger");
        fire_reset_pulse(now_us);
        last_link_beat = -1.0;
    }
    prev = now_active;
}

// --- LEDs -----------------------------------------------------------------
static void update_blue_led(unsigned long now_ms) {
    if (!link_enabled) {
        led_off(PIN_BLUE_LED);
    } else if (WiFi.status() != WL_CONNECTED) {
        if ((now_ms / 100) & 1) led_on(PIN_BLUE_LED); else led_off(PIN_BLUE_LED);
    } else if (link_peer_count() == 0) {
        if ((now_ms / 250) & 1) led_on(PIN_BLUE_LED); else led_off(PIN_BLUE_LED);
    } else {
        led_on(PIN_BLUE_LED);
    }
}

static void update_red_led(unsigned long now_ms) {
    // Inline "no address" flash takes priority while its window is open.
    if (recorder_no_addr_flash_until_ms != 0) {
        if ((long)(now_ms - recorder_no_addr_flash_until_ms) >= 0) {
            recorder_no_addr_flash_until_ms = 0;
            led_off(PIN_RED_LED);
        }
        return;  // stay on (or just turned off) until the window expires
    }
    switch (recorder_led_state) {
        case RECORDER_LED_IDLE:         led_off(PIN_RED_LED); break;
        case RECORDER_LED_IN_FLIGHT:    led_on(PIN_RED_LED);  break;
        case RECORDER_LED_ERROR_STICKY: led_on(PIN_RED_LED);  break;
    }
}

// --- WiFi -----------------------------------------------------------------
// Bring-up ordering matters. Arduino initialises the Wi-Fi driver inside
// WiFi.mode(); any esp_wifi_* setter called before that returns
// ESP_ERR_WIFI_NOT_INIT and is silently discarded. Everything here runs
// after mode() for that reason.
//
// The C5 is dual-band, so a plain connect scans 2.4 GHz *and* the whole
// 5 GHz band — and under the IDF default country ("01", world-safe mode,
// 802.11d on) many of those channels are scanned passively, a full beacon
// interval each. That is where multi-second connects come from. Three
// things cut it down, each with a fallback:
//   1. a real country code    -> active scanning on legal channels
//   2. 5 GHz-only band mode   -> the 2.4 GHz half of the scan disappears
//   3. a cached BSSID+channel -> a known AP is joined with no scan at all
// Stale cache falls back to a scan; no 5 GHz AP falls back to dual band.

constexpr char     WIFI_COUNTRY[]               = "GB";
constexpr uint32_t WIFI_FAST_CONNECT_TIMEOUT_MS = 4000;   // cached-BSSID path
constexpr uint32_t WIFI_RETRY_INTERVAL_MS       = 15000;  // loop() backstop
constexpr bool     WIFI_PREFER_5G               = true;

static bool          wifi_band_5g_only  = false;
static unsigned long wifi_next_retry_ms = 0;

// 5 GHz channels 52–144 are DFS: the AP must vacate them if it detects
// radar, and stations scan them passively. Worth flagging in the log —
// it is a real source of mid-session disconnects.
static bool channel_is_dfs(uint8_t ch) { return ch >= 52 && ch <= 144; }

// --- Last-known-good AP cache (NVS) --------------------------------------
static bool wifi_cache_load(uint8_t bssid[6], uint8_t* channel) {
    Preferences p;
    if (!p.begin("clklinkrec", true)) return false;
    size_t n = p.getBytes("bssid", bssid, 6);
    uint8_t ch = p.getUChar("chan", 0);
    p.end();
    if (n != 6 || ch == 0) return false;
    *channel = ch;
    return true;
}

static void wifi_cache_store(const uint8_t bssid[6], uint8_t channel) {
    Preferences p;
    if (!p.begin("clklinkrec", false)) return;
    p.putBytes("bssid", bssid, 6);
    p.putUChar("chan", channel);
    p.end();
}

static void wifi_cache_clear() {
    Preferences p;
    if (!p.begin("clklinkrec", false)) return;
    p.remove("bssid");
    p.remove("chan");
    p.end();
}

// --- Radio configuration --------------------------------------------------
static void wifi_set_band_mode(bool five_g_only) {
#if defined(SOC_WIFI_SUPPORT_5G) && SOC_WIFI_SUPPORT_5G
    wifi_band_mode_t mode = five_g_only ? WIFI_BAND_MODE_5G_ONLY
                                        : WIFI_BAND_MODE_AUTO;
    esp_err_t err = esp_wifi_set_band_mode(mode);
    if (err == ESP_OK) {
        wifi_band_5g_only = five_g_only;
        Serial.printf("[WiFi] band mode: %s\n",
                      five_g_only ? "5 GHz only" : "2.4 + 5 GHz");
    } else {
        wifi_band_5g_only = false;
        Serial.printf("[WiFi] esp_wifi_set_band_mode failed: %s\n",
                      esp_err_to_name(err));
    }
#else
    wifi_band_5g_only = false;
    (void)five_g_only;
#endif
}

// Everything that must happen after esp_wifi_init() (i.e. after
// WiFi.mode()) but before association.
static void wifi_apply_radio_config() {
    WiFi.mode(WIFI_STA);
    WiFi.setAutoReconnect(true);

    // Power save off *before* associating, so the association and DHCP
    // exchange don't run through modem-sleep DTIM gaps either. Link's
    // multicast discovery needs this on permanently.
    WiFi.setSleep(false);
    esp_err_t err = esp_wifi_set_ps(WIFI_PS_NONE);
    if (err != ESP_OK) {
        Serial.printf("[WiFi] esp_wifi_set_ps failed: %s\n", esp_err_to_name(err));
    }

    // Deprecated esp_wifi_set_country() only ever described the 2.4 GHz
    // channel list. The country code call sets the regulatory tables for
    // both bands. ieee80211d_enabled = false so the configured country is
    // always used rather than whatever the AP advertises.
    err = esp_wifi_set_country_code(WIFI_COUNTRY, false);
    if (err != ESP_OK) {
        Serial.printf("[WiFi] esp_wifi_set_country_code(%s) failed: %s\n",
                      WIFI_COUNTRY, esp_err_to_name(err));
    } else {
        char cc[3] = {};
        esp_wifi_get_country_code(cc);
        Serial.printf("[WiFi] country: %s (active scan on %s channels)\n",
                      cc, cc);
    }

    wifi_set_band_mode(WIFI_PREFER_5G);

    // Only valid once the driver is started.
    Serial.printf("[WiFi] MAC: %s\n", WiFi.macAddress().c_str());
}

// --- Association ----------------------------------------------------------
// One association attempt. Passing a bssid/channel skips the scan
// entirely; passing nullptr does a normal scan-and-join.
static bool wifi_attempt(const uint8_t* bssid, uint8_t channel,
                         uint32_t timeout_ms, const char* what) {
    unsigned long t0 = millis();
    // Clear any stored AP config first, otherwise a previously pinned
    // (and now stale) BSSID keeps being retried by the driver.
    WiFi.disconnect(false, true);
    delay(20);

