Eight4aWish/eurorack_modules/src/esp32_clklinkrec/main.cpp
    if (bssid) {
        WiFi.begin(WIFI_SSID, WIFI_PASS, (int32_t)channel, bssid);
    } else {
        WiFi.begin(WIFI_SSID, WIFI_PASS);
    }

    while (WiFi.status() != WL_CONNECTED && (millis() - t0) < timeout_ms) {
        delay(25);
    }
    bool ok = (WiFi.status() == WL_CONNECTED);
    Serial.printf("[WiFi] %s: %s in %lu ms\n", what,
                  ok ? "associated" : "no association",
                  millis() - t0);
    return ok;
}

// Log what we actually landed on and refresh the AP cache.
static void wifi_on_connected() {
    wifi_ap_record_t ap = {};
    if (esp_wifi_sta_get_ap_info(&ap) == ESP_OK) {
        Serial.printf("[WiFi] %s  ch %u (%s)  RSSI %d dBm  "
                      "BSSID %02x:%02x:%02x:%02x:%02x:%02x  IP %s\n",
                      WiFi.SSID().c_str(), ap.primary, band_of(ap.primary),
                      ap.rssi,
                      ap.bssid[0], ap.bssid[1], ap.bssid[2],
                      ap.bssid[3], ap.bssid[4], ap.bssid[5],
                      WiFi.localIP().toString().c_str());
        if (channel_is_dfs(ap.primary)) {
            Serial.println("[WiFi] note: this is a DFS channel — the AP may "
                           "channel-switch under radar, and scans of it are "
                           "passive. A non-DFS channel (36-48 / 149-165) is "
                           "more stable for clock sync.");
        }
        wifi_cache_store(ap.bssid, ap.primary);
    } else {
        Serial.printf("[WiFi] connected, IP %s\n",
                      WiFi.localIP().toString().c_str());
    }
}

// Boot-time connect. Blocking is fine here — nothing else is running yet.
static bool wifi_connect_blocking() {
    wifi_apply_radio_config();

    uint8_t bssid[6];
    uint8_t channel = 0;
    if (wifi_cache_load(bssid, &channel)) {
        Serial.printf("[WiFi] cached AP %02x:%02x:%02x:%02x:%02x:%02x ch %u — "
                      "joining without a scan\n",
                      bssid[0], bssid[1], bssid[2],
                      bssid[3], bssid[4], bssid[5], channel);
        if (wifi_attempt(bssid, channel, WIFI_FAST_CONNECT_TIMEOUT_MS,
                         "cached AP")) {
            wifi_on_connected();
            return true;
        }
        Serial.println("[WiFi] cached AP didn't answer — clearing cache");
        wifi_cache_clear();
    }

    if (wifi_attempt(nullptr, 0, WIFI_CONNECT_TIMEOUT_MS,
                     wifi_band_5g_only ? "scan (5 GHz)" : "scan (2.4 + 5 GHz)")) {
        wifi_on_connected();
        return true;
    }

    if (wifi_band_5g_only) {
        Serial.println("[WiFi] nothing on 5 GHz — retrying across both bands");
        wifi_set_band_mode(false);
        if (wifi_attempt(nullptr, 0, WIFI_CONNECT_TIMEOUT_MS,
                         "scan (2.4 + 5 GHz)")) {
            wifi_on_connected();
            return true;
        }
    }

    Serial.println("[WiFi] not connected — Link + Recorder will retry in "
                   "the background");
    return false;
}

// Backstop retry from loop(). Deliberately non-blocking: a Eurorack clock
// must not stall for seconds because the AP went away, so this only kicks
// off an attempt and lets the status edge in loop() pick up the result.
static void wifi_maintain(unsigned long now_ms) {
    if (WiFi.status() == WL_CONNECTED) {
        wifi_next_retry_ms = 0;
        return;
    }
    if (wifi_next_retry_ms != 0 && (long)(now_ms - wifi_next_retry_ms) < 0) {
        return;
    }
    wifi_next_retry_ms = now_ms + WIFI_RETRY_INTERVAL_MS;

    uint8_t bssid[6];
    uint8_t channel = 0;
    Serial.println("[WiFi] disconnected — re-attempting association");
    if (wifi_cache_load(bssid, &channel)) {
        WiFi.begin(WIFI_SSID, WIFI_PASS, (int32_t)channel, bssid);
    } else {
        WiFi.begin(WIFI_SSID, WIFI_PASS);
    }
}

// --- Setup ----------------------------------------------------------------
static void print_chip_info() {
    esp_chip_info_t info = {};
    esp_chip_info(&info);
    Serial.printf("[Chip] ESP32-C5 rev %u, %u core(s), CPU %u MHz, IDF %s\n",
                  (unsigned)info.revision, info.cores,
                  (unsigned)ESP.getCpuFreqMHz(), esp_get_idf_version());
    Serial.printf("[Heap] internal free: %u / %u\n",
                  (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
                  (unsigned)heap_caps_get_total_size(MALLOC_CAP_INTERNAL));
}

void setup() {
    Serial.begin(115200);
    uint32_t t0 = millis();
    while (!Serial && millis() - t0 < 3000) { delay(10); }
    delay(100);
    Serial.println("\n=== esp32_clklinkrec (Link sync + Recorder) ===");

    Serial.setDebugOutput(true);
    esp_log_level_set("*",         ESP_LOG_INFO);
#if WIFI_DEBUG_LOG
    esp_log_level_set("wifi",      ESP_LOG_INFO);
    esp_log_level_set("wifi_init", ESP_LOG_INFO);
#else
    esp_log_level_set("wifi",      ESP_LOG_WARN);
    esp_log_level_set("wifi_init", ESP_LOG_WARN);
#endif
    esp_log_level_set("phy_init",  ESP_LOG_WARN);

    print_chip_info();

    pinMode(PIN_CLK_OUT,  OUTPUT); release_out(PIN_CLK_OUT);
    pinMode(PIN_RST_OUT,  OUTPUT); release_out(PIN_RST_OUT);
    pinMode(PIN_RUN_OUT,  OUTPUT); release_out(PIN_RUN_OUT);
    pinMode(PIN_RED_LED,  OUTPUT); led_off(PIN_RED_LED);
    pinMode(PIN_BLUE_LED, OUTPUT); led_off(PIN_BLUE_LED);
    pinMode(PIN_SW_LINK,    INPUT_PULLUP);
    pinMode(PIN_SW_CAPTURE, INPUT_PULLUP);
    pinMode(PIN_RESET_IN,   INPUT);

    Serial.printf("[WiFi] target SSID \"%s\"\n", WIFI_SSID);

    if (wifi_connect_blocking()) {
        WiFiUDP udp;
        if (udp.beginPacket(IPAddress(224, 76, 78, 75), 20808)) {
            udp.print("clklinkrec-mcast-test");
            int sent = udp.endPacket();
            Serial.printf("[WiFi] multicast TX self-test: endPacket=%d\n", sent);
        } else {
            Serial.println("[WiFi] multicast TX self-test: beginPacket FAILED");
        }

        // mDNS responder on our side gives the Mac a name to ping back
        // (not strictly required by the v2 protocol, but a courtesy).
        // Resolve the recorder service + healthz check.
        if (MDNS.begin("clklinkrec")) {
            Serial.println("[mDNS] responder started as clklinkrec.local");
        } else {
            Serial.println("[mDNS] responder failed to start");
        }
        resolve_recorder_address();
        check_recorder_healthz();
    }

    link_init();

    Serial.println("[Setup] ready. Link starts disabled. Press Link button to enable.");
    Serial.println("        Press Capture button to POST /capture to the recorder.");
}

// --- Loop -----------------------------------------------------------------
void loop() {
    unsigned long now_us = micros();
    unsigned long now_ms = millis();

    poll_buttons();
    poll_reset_in(now_us);
    link_tick(now_us);
    update_pulse_decay(now_us);
    update_blue_led(now_ms);
    update_red_led(now_ms);

    // WiFi reconnect detection: on the false→true edge, re-resolve the
    // recorder address. The Mac may have moved to a new IP, or we may
    // have come up before the recorder did.
    // Seeded from the real state on first entry: setup() has already done
    // the connect and the recorder lookup, and repeating the (blocking,
    // ~3 s) mDNS query here would just delay the module coming up.
    static bool wifi_was_connected = (WiFi.status() == WL_CONNECTED);
    bool wifi_is_connected = (WiFi.status() == WL_CONNECTED);
    if (wifi_is_connected && !wifi_was_connected) {
        Serial.println("[WiFi] reconnected — re-resolving recorder address");
        wifi_on_connected();
        resolve_recorder_address();
        check_recorder_healthz();
    }
    wifi_was_connected = wifi_is_connected;

    // Backstop for the driver's own auto-reconnect: if we're still down
    // after WIFI_RETRY_INTERVAL_MS, kick off another association attempt.
    wifi_maintain(now_ms);

    // Periodic Link telemetry, only when something changes.
    static unsigned long last_log_ms       = 0;
    static size_t        last_peers        = 0xFFFF;
    static double        last_tempo        = -1.0;
    static bool          last_playing      = false;
    if (link_enabled && link_initialised && (now_ms - last_log_ms) >= 1000) {
        last_log_ms = now_ms;
        abl_link_capture_app_session_state(link_handle, link_state);
        size_t peers   = link_peer_count();
        double tempo   = abl_link_tempo(link_state);
        bool   playing = abl_link_is_playing(link_state);
        if (peers != last_peers || fabs(tempo - last_tempo) > 0.05 || playing != last_playing) {
            Serial.printf("[Link] peers=%u tempo=%.2f playing=%d\n",
                          (unsigned)peers, tempo, playing ? 1 : 0);
            last_peers   = peers;
            last_tempo   = tempo;
            last_playing = playing;
        }
    }

    delay(1);
}
